[
  {
    "chapter": "",
    "questions": [
      "عرف النحو مع بيان غرضه وموضوعه",
      "اذكر فائدة علم النحو",
      "عرف الكلمة وعدد أقسامها"
    ]
  },
  {
    "chapter": "أسثلة الكلمة (اسم وفعل وحرف)",
    "questions": [
      "عرف الاسم وبين فوائد قيود تعريفه، ثم أوضحه بمثال",
      "عدد علامات الاسم مع ذكر مثال لكل واحدة منها",
      "اذكر تعريف الفعل، ومثل لذلك",
      "عدد علامات الفعل ومثل لكل واحدة منها",
      "اذكر تعريف الحرف ومثل له",
      "بين فوائد الحرف ومثل لها"
    ]
  },
  {
    "chapter": "أسثلة الجملة",
    "questions": [
      "عرف الكلام والإسناد ووضحهما بمثال",
      "متى تكون اللفظ كلاما؟ وضح ذلك بأمثلة",
      "اذكر أقسام الجملة، ومثل لها",
      "أوضح الاعتراض والجواب في انحصار الكلام في القسمين المذكورين"
    ]
  },
  {
    "chapter": "أسثلة المعرب",
    "questions": [
      "عرف الاسم المعرب ومثل له",
      "ما هو الاسم المتمكن؟ اضرب مثالا له",
      "ما معنى الإعراب؟",
      "اذكر أنواع إعراب الاسم ثم عين العلامات لكل منها",
      "عرف العامل وبين محل الإعراب",
      "ما هو الاسم الجاري مجرى الصحيح؟ ومثل له",
      "كيف يعرب كل من الاسم المفرد المنصرف الصحيح، والجاري مجرى الصحيح والجمع المكسر المنصرف؟",
      "اذكر كيفية إعراب جمع المؤنث السالم، ومثل لذلك",
      "بم يعرب الاسم الغير المنصرف؟ هات مثالا يوضح ذلك",
      "اذكر الأسماء الستة وبين علامات إعرابها مع ذكر أمثلة",
      "كم شرطا لذلك الإعراب وماهي؟ ثم بين إعرابها عند فوات كل شرط منها",
      "ما هو إعراب المثنى؟ بين بالتمثيل",
      "ما هو إعراب كلا وكلتا إذا أضيفتا إلى الضمير؟ وما هو إعرابهما إذا أضيفتا إلى المظهر؟ مثل لكل منهم",
      "ما هو إعراب جمع المذكر السالم وما هي ملحقاته؟ أوضح بالأمثلة. ثم اذكر من القرآن الكريم شواهد 'أولو' رفعا ونصبا وجرا",
      "ما هي حركة نوني التثنية والجمع دائما؟ مثل لهما",
      "متى تسقط نونا التثنية وجمع المذكر السالم؟ أجب بأمثلة مفيدة",
      "أي الأسماء تقدر فيه جميع علامات إعرابها؟ اذكرها مع مثال",
      "عرف الاسم المنقوص وبين علامات إعرابه مع ضرب أمثلة",
      "كيف يكون إعراب جمع المذكر السالم إذا أضيف إلى ياء المتكلم؟ مثل لذلك"
    ]
  },
  {
    "chapter": "أسثلة المنصرف وغير المنصرف",
    "questions": [
      "كم قسما للاسم المعرب وما هي؟",
      "عرف المنصرف وبين حكمه مع مثال",
      "عرف غير المنصرف وبين حكمه",
      "كم سببا لمنع الصرف وما هي؟ عدده",
      "عرف العدل وبين أقسامه مع ذكر أمثلة",
      "ما السببان اللذان يجتمع معهما العدل؟ أوضح بمثالين",
      "ما هو الوصف لغة واصطلاحا؟ وما هو شرطه؟ أوضح بأمثلة",
      "اذكر شرط التأنيث بالتاء ومثل له",
      "اكتب شرط جواز تأثير المؤنث المعنوي وشرط وجوب تأثيره، ومثل لكل صورة",
      "ماذا حكم المؤنث المعنوي إذا كان علما ثلاثيا ساكن الأوسط غير أعجمي؟ أوضح بمثال",
      "هل يشترط أن يجتمع سبب من الأسباب مع التأنيث بالألف المقصورة والممدودة؟ أوضح مع الوجه",
      "أي الأسباب يجتمع مع العلمية مؤثرا وأي لا يجتمع؟",
      "كم شرطا للعجمة في منع الصرف؟ مثل لذلك",
      "هل يمنع من الصرف الاسم العجمي إذا كان ثلاثيا ساكن الأوسط؟ اذكر أمثلة لذلك",
      "كم شرطا للجمع في منع الصرف؟ وما هي؟ مثل له",
      "كيف يقوم سبب الجمع مقام السببين؟ أوضح بمثال",
      "كم شرطا للتركيب في منع الصرف؟ وما هي؟ مثل لذلك",
      "إذا كان التركيب بالإضافة أو الإسناد فهل يمنع من الصرف؟ وضح ذلك بمثال",
      "ما هو شرط الألف والنون الزائدتان لمنع الصرف في الاسم؟ وما شرطهما للمنع في الصفة؟ مثل لذلك",
      "اذكر شروط وزن الفعل في منع الصرف",
      "كم قسما لأسباب منع الصرف باعتبار العلمية؟ وما هي؟ بين مع الأحكام",
      "عدد أسباب منع الصرف التي تجتمع معها العلمية شرطا وعدد التي معها سببا",
      "كم صورة لتنكير الأعلام؟ وما هي؟ أوضح بأمثلة"
    ]
  },
  {
    "chapter": "المرفوعات - أسثلة الفاعل",
    "questions": [
      "كم قسما للأسماء المرفوعة وما هي؟ عددها مرتبة",
      "عرف الفاعل وبين فوائد قيود تعريفه",
      "كم شرطا لكون الاسم فاعلا وما هي؟",
      "كم قسما للفاعل؟ وما هي؟ أوضح بالأمثلة",
      "متى يجب توحيد الفعل؟ ومتى يجب مطابقة الفعل الفاعل؟ بين بالأمثلة",
      "اذكر مواضع تذكير الفعل وتأنيثه بالأمثلة",
      "ماذا حكم الفعل إذا كان الفاعل جمع المذكر السالم ظاهرا أو ضميرا؟ بين بالتمثيل"
    ]
  },
  {
    "chapter": "أسثلة التنازع",
    "questions": [
      "ما هو التنازع لغة واصطلاحا؟",
      "كم قسما للتنازع؟ اكتب كل قسم ممثلا",
      "ما الخلاف بين جمهور النحاة والإمام الفراء في الصورة الأولى والثالثة؟ أوضح دليل الفراء مع المثال",
      "ما هو مدار الخلاف بين العلماء البصريين والعلماء الكوفيين؟ وماذا قالوا؟ بين مدللا",
      "ماذا تفعل إن أعملت الثاني على مذهب البصريين ويقتضي الأول الفاعل؟ اكتب مع الأمثلة",
      "ماذا تفعل على مذهبهم إن كان الفعل الثاني يقيضي المفعول وكان الفعلان من أفعال القلوب؟ ولماذا؟ أوضح بالأمثلة",
      "ماذا تفعل إن أعملت الأول على مذهب الكوفيين والثاني يقتضي الفاعل؟ اكتب ممثلا",
      "وكم صورة تجوز علىى مذهبهم إن كان الفعل الثاني يقتضي المفعول ولم يكن الفعلان من أفعال القلوب؟ وما هو المختار؟ ولماذا؟ مثل كل صورة",
      "ماذا تفعل على مذهبهم إن كان الفعل الثاني يقتضي المفعول والفعلان من أفعال القلوب؟ بين بالأمثلة معللا"
    ]
  },
  {
    "chapter": "أسثلة المبتدأ والخبر",
    "questions": [
      "عرف المبتدأ والخبر ومثل لهم",
      "ما المراد من العوامل اللفظية؟ وكيف صار بحسبك في قولك بحسبك درهم مبتدأ مع أنه متصل بعامل لفظي؟",
      "ما هو عامل المبتدأ والخبر؟ وما المراد منه؟",
      "ما الأصل في المبتدأ والخبر؟ بين بالأمثلة",
      "متى يجوز أن تكون النكرة مبتدأ؟ ثم أوضح وجوه التخصيص في هذه الأمثلة: (١) ولعبد مؤمن خير من مشرك (٢) أرجل في الدار أم امرأة (٣) ما أحد خير منك (٤) شر أهر ذا ناب (٥) في الدار رجل (٦) سلام عليك",
      "إذا كان المبتدأ والخبر كلاهما معرفتين فما الحكم؟ وضح بالأمثلة",
      "كم نوعا من الجمل يكون خبرا؟ مثل لكل منها",
      "إذا كان الخبر ظرفا فما الاختلاف فيه بين النحاة؟ أوضح بمثال",
      "متى يلزم في الخبر رابط؟ مثل له",
      "اذكر خمسة روابط بالأمثلة",
      "متى يجوز حذف ذلك الرابط؟ أوضح بمثال",
      "متى يجب تعدد الخبر؟ اذكر بمثال",
      "عرف القسم الثاني من المبتدأ واذكر شرطه"
    ]
  },
  {
    "chapter": "أسثلة خبر إن وأخواتها",
    "questions": [
      "عدد إن وأخواتها؟ اذكر عملها ممثلا",
      "ما حكم خبر إن وأخواتها؟ وضح بالأمثلة",
      "متى لا يجوز تقديم أخبارها على أسماءها؟ ومتى يجوز؟ ومتى يجب؟"
    ]
  },
  {
    "chapter": "أسثلة اسم كان وأخوانها",
    "questions": [
      "عدد الأفعال الناقصة واذكر عملها بالتمثيل",
      "هل يجوز تقديم أخبار كان وأخواتها على أسماءها؟ أوضح بالأمثلة",
      "كم قسما للأفعال الناقصة؟ من حيث تقديم أخبارها عليها؟ وما هي؟"
    ]
  },
  {
    "chapter": "أسثلة خبر لا التي لنفي الجنس",
    "questions": ["كم فرقا بين ما ولا؟ وما هي؟"]
  },
  {
    "chapter": "أسثلة المنصوبات والمفعول المطلق",
    "questions": [
      "عدد الأسماء المنصوبة",
      "عرف المفعول المطلق واذكر فوائد قيوده",
      "ماالمراد من الفعل في تعريفه؟",
      "كم غرضا يستعمل له المفعول المطلق؟ مثل لكل منها بأمثلة",
      "هل يكون المفعول المطلق مغايرا لفعله؟ وكم صورة للمغايرة؟ مثل لكل صورة",
      "متى يحذف فعله جوازا؟ أوضح بالتمثيل"
    ]
  },
  {
    "chapter": "أسثلة المفعول به",
    "questions": [
      "عرف المفعول به ومثل له",
      "وما المراد من وقوع الفعل في تعريفه؟",
      "متى يحذف فعل المفعول به جوازا؟ اذكر مثالين من نفسك ومثالين من القرآن الكريم",
      "كم موضعا يجب فيه حذف فعله؟ اذكر الموضع الأول مع الأمثلة",
      "ما هو التحذير لغة واصطلاحا؟ وكم قسما للتحذير اذكر ممثل",
      "عرف ما أضمر عامله على شريطة التفسير، وبين قوائد قيوده، ثم وضحه بمثال",
      "اذكر له مثالين من القرآن الكريم",
      "كم صورة لتسليط الفعل وما هي؟ اذكر بمثال لكل صورة"
    ]
  },
  {
    "chapter": "أسثلة المنادى",
    "questions": [
      "عرف المنادى لغة اصطلاحا",
      "ما هو العامل للمنادى؟ اذكر الخلاف فيه",
      "كم حرفا للنداء وما هي؟",
      "متى يحذف حرف النداء من اللفظ؟ اذكر له مثالين",
      "كم قسما للمنادى باعتبار الإعراب والبناء؟ عدد الأقسام",
      "متى يكون المنادى مبنيا على علامة الرفع؟ مثل له",
      "ما هو المراد من المفرد ههنا؟ وما المراد من المعرفة؟",
      "متى يكون المنادى مجرورا؟ اذكر مثالين",
      "متى يكون المنادى مبنيا على الفتح؟ مثل له",
      "متى يكون المنادى منصوبا؟ مثل لكل صورة",
      "عرف المشابه للمضاف واذكر وجه تسميته",
      "ما معنى الترخيم لغة واصطلاحا؟ أوضح بثلاثة أمثلة",
      "ما حكم آخر المنادى المرخم؟ بين بمثال",
      "عرف المندوب لغة واصطلاحا، ومثل ل",
      "ما هو الحرف المختص للمندوب؟ وما هو المشترك بين المندوب والمنادى؟"
    ]
  },
  {
    "chapter": "أسثلة المفعول فيه",
    "questions": [
      "عرف المفعول فيه ومثل له",
      "ما هو المراد من الفعل في تعريفه وما يشمله؟",
      "ما هو الاسم الثاني للمفعول فيه؟",
      "كم قسما لظروف الزمان وكم قسما لظروف المكان؟ عرف كل قسم بمثال",
      "أي ظرف ينصب بتقدير 'في'؟",
      "وأي ظرف يجب ذكر 'في' قبلها؟"
    ]
  },
  {
    "chapter": "أسثلة المفعول له",
    "questions": [
      "عرف المفعول له وبين فوائد قيوده",
      "كم قسما للمفعول له؟ اذكر لكل قسم شاهدا من القرآن الكريم",
      "ماذا يقدر في المفعول له؟",
      "اذكر نبذة من ترجمة الإمام الزجاج رحمه الله تعالى",
      "ماذا قال الإمام الزجاج في المفعول له؟ وكيف يؤول مثل قولك: ضربت زيدا بأديبا؟",
      "بماذا رد قول الزجاج؟"
    ]
  },
  {
    "chapter": "أسثلة المفعول معه",
    "questions": [
      "عرف المفعول معه ومثل له",
      "كم وجها لإعراب الاسم الواقع بعد الواو بمعنى مع؟ اذكرها بالأمثلة"
    ]
  },
  {
    "chapter": "أسثلة الحال",
    "questions": [
      "عرف الحال لغة واصطلاحا واذكر له ثلاثة أمثلة",
      "ما معنى كون الفاعل والمفعول به معنويا؟ أوضح بمثالين",
      "ما هو العامل في الحال؟ اذكر له مثالين",
      "كيف تكون الحال أبدا؟ وكيف يكون صاحبها غالبا؟",
      "ماذا يجب عليك إذا كان ذوالحال نكرة؟ ولماذا؟",
      "هات شاهدين من القرآن الكريم لوقوع الحال جملة",
      "متى يحذف عامل الحال؟ أوضح بأربعة أمثلة"
    ]
  },
  {
    "chapter": "أسثلة التمييز",
    "questions": [
      "ما هو التمييز؟ أوضحه بمثال",
      "كم قسما للمفرد المقدار وما هي؟ اذكر مثالا لكل قسم",
      "كم قسما للعدد وما هي؟ اذكر مثالين من القرآن الكريم",
      "في أي قسم من التمييز الخفض أكثر؟ أوضح بمثال",
      "هل يأتي التمييز بعد الجملة أو شبهها ولم؟ أوضح بأمثلة"
    ]
  },
  {
    "chapter": "أسثلة المستثنى",
    "questions": [
      "عرف المستثنى لغة واصطلاحا",
      "كم قسما للمستثنى وما هي؟ عرف كل قسم ومثل له",
      "كم نوعا لإعراب المستثنى وما هي؟ أوضح كل نوع بمثالين",
      "متى يجوز النصب ويختار البدل في المستثنى؟ استشهد بالقرآن الكريم",
      "عرف المفرغ لغة واصطلاحا، واستشهد له من القرآن الكريم",
      "ما معنى الموجب وغير الموجب؟",
      "ما إعراب 'غير' إذا كان بمعنى 'إلا'؟ وما إعرابه إذا كان صفة؟ أوضح بالأمثلة",
      "متى يكون 'إلا' بمعنى 'غير'؟ استشهد له من القرآن الكريم",
      "عين أنواع إعراب المستثنى"
    ]
  }
]
